{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Payment Terms",
    "1": "Intellectual Property",
    "2": "Termination",
    "3": "Confidentiality",
    "4": "Force Majeure",
    "5": "Indemnification",
    "6": "Governing Law",
    "7": "Warranty",
    "8": "Liability"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Confidentiality": 3,
    "Force Majeure": 4,
    "Governing Law": 6,
    "Indemnification": 5,
    "Intellectual Property": 1,
    "Liability": 8,
    "Payment Terms": 0,
    "Termination": 2,
    "Warranty": 7
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vocab_size": 30522
}
